In [1]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.DataFrame({'id':[81010,81011,81012,81013],
                  'DA':[20,15,18.75,10],
                  'SI':[16,17,20,13],
                'IL':[17,13,14,11]})
df1

      id     DA  SI  IL
0  81010  20.00  16  17
1  81011  15.00  17  13
2  81012  18.75  20  14
3  81013  10.00  13  11

In [3]:
df2=pd.DataFrame({'id':[81010,81012,81013,81014,81015],
                  'GPA':[16.5,18,15,19.3,17.7],
                  'uni':['A0','A1','A2','A3','A5']})
df2

      id   GPA uni
0  81010  16.5  A0
1  81012  18.0  A1
2  81013  15.0  A2
3  81014  19.3  A3
4  81015  17.7  A5

In [4]:
pd.merge(df1,df2)

      id     DA  SI  IL   GPA uni
0  81010  20.00  16  17  16.5  A0
1  81012  18.75  20  14  18.0  A1
2  81013  10.00  13  11  15.0  A2

In [5]:
pd.merge(df1,df2,on='id')

      id     DA  SI  IL   GPA uni
0  81010  20.00  16  17  16.5  A0
1  81012  18.75  20  14  18.0  A1
2  81013  10.00  13  11  15.0  A2